Revit 2024 API
ExternalServices.BuiltInExternalServices.ModifyConnectionParametersService Property
 The external service to view and modify structural connection parameters.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId ModifyConnectionParametersService { get; }
Visual Basic
Public Shared ReadOnly Property ModifyConnectionParametersService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ ModifyConnectionParametersService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace